package com.company.lab34;

public class Lab34 {
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//    lab_4
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

    /*
    Создать классы, спецификации которых приведены ниже. Определить конструкторы и методы
    setТип(), getТип(), toString(). Определить дополнительно методы в классе, создающем массив
    объектов. Задать критерий выбора данных и вывести эти данные на консоль.

    Book: id, Название, Автор(ы), Издательство, Год издания, Количество страниц, Цена, Переплет.
    Создать массив объектов. Вывести: a) список книг заданного автора; b) список книг, выпущенных
    заданным издательством; c) список книг, выпущенных после заданного года.
     */
    public static void lab_4() {
        BookList books = new BookList();
        books.append(new Book(
                0, "Идиот", "Достоевский Ф.М.", "АСТ", "Мягкий", 2014, 456, 230
        ));
        books.append(new Book(
                1, "Линейная алгебра", "Кремер Н. Ш., Фридман М. Н., Тришин И. М.", "Юрайт", "Твердый", 2019, 354, 340
        ));
        books.append(new Book(
                2, "Белый Клык", "Лондон Джек", "Махаон", "Твердый", 2021, 224, 130
        ));
        books.append(new Book(
                3, "Мертвые души", "Гоголь Н.В.", "Питер", "Мягкий", 2012, 280, 150
        ));
        books.append(new Book(
                4, "Призрак оперы", "Леру Гастон", "Питер", "Мягкий", 2013, 379, 180
        ));

        String author = new String("Достоевский Ф.М.");
        System.out.println("Список книг автора " + author + ":\n");
        System.out.println(books.getByAuthors(author));

        String publication = new String("Питер");
        System.out.println("Список книг издательства " + publication + ":\n");
        System.out.println(books.getByPublication(publication));

        int year = 2015;
        System.out.println("Список книг, изданных после " + year + " года:\n");
        System.out.println(books.getWithYearGreaterThan(year));
    }

}
